app/controllers/user_controller.rb

  def index
    if params[:query]
      @users = User.where("first_name like '%#{params[:query]}%' or
                          last_name like '%#{params[:query]}%' or
                          email like '%#{params[:query]}%' or
                          phone like '%#{params[:query]}%'
                          ").sort.page params[:page]
    else
      @users = User.all.sort.page params[:page]
---
SELECT  "users".* FROM "users" WHERE (first_name = 'sushi' or last_name = 'sushi' or email = 'sushi' or phone = 'sushi') LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM "users" WHERE (first_name = 'sushi' or last_name = 'sushi' or email = 'sushi' or phone = 'sushi')
SELECT  "users".* FROM "users" LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM "users"

  def create
    user = User.create(user_params)
---
INSERT INTO "users" ("first_name", "last_name", "email", "phone", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["first_name", "F1"], ["last_name", "L1"], ["email", "asdf@asdf.com"], ["phone", "0123456789"], ["created_at", "2015-05-11 15:23:04.686584"], ["updated_at", "2015-05-11 15:23:04.686584"]]

  def update

    if @user.update_attributes(user_params)
---
UPDATE "users" SET "first_name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["first_name", "F1aaaa"], ["updated_at", "2015-05-11 16:49:53.613255"], ["id", 11]]

  def destroy
    if @user.destroy
---
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]

  def find_user
    begin
      @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", nil]]